app/Controllers/Alumnos.php

SELECT *
FROM `alumnos`
WHERE `activo` = 1
---
    public function index($activo=1)
    {
        //http://localhost/codeigniter4/public/Alumnos
        // URL / controlador / metodo index por defecto
        $resultado = $this->modelalumnos->where("activo",$activo)->findAll();

SELECT *
FROM `alumnos`
WHERE `idalumno` = '1'
 LIMIT 1
---
    public function editar($id){
        $resultado = $this->modelalumnos->where("idalumno",$id)->first();

SELECT *
FROM `alumnos`
WHERE `activo` = 0
---
    public function eliminados($activo=0)
    {
        //http://localhost/codeigniter4/public/Alumnos
        // URL / controlador / metodo index por defecto
        $resultado = $this->modelalumnos->where("activo",$activo)->findAll();