app/Controllers/Cursos.php

SELECT *
FROM `cursos`
WHERE `activo` = 1
---
    public function index($activo=1)
    {
        //http://localhost/codeigniter4/public/Cursos
        // URL / controlador / metodo index por defecto
        $resultado = $this->modelcursos->where("activo",$activo)->findAll();