app/Controllers/Profesores.php

SELECT *
FROM `profesores`
WHERE `activo` = 1
---
    public function index($activo=1)
    {
        //http://localhost/codeigniter4/public/Profesores
        // URL / controlador / metodo index por defecto
        $resultado = $this->modelprofesores->where("activo",$activo)->findAll();